app/controllers/reports_controller.rb

SELECT "reports".* FROM "reports"
---
  def index
    @reports = Report.all

INSERT INTO "reports" ("time_occur", "latitude", "longitude", "location", "tags", "description", "user", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @report = Report.new(report_params)

    respond_to do |format|
      if @report.save

UPDATE "reports" SET "location" = ?, "updated_at" = ? WHERE "reports"."id" = ?  [["location", "Humperdinks front counter"], ["updated_at", "2022-05-09 08:42:57.874362"], ["id", 8]]
---
  def update
    respond_to do |format|
      if @report.update(report_params)

DELETE FROM "reports" WHERE "reports"."id" = ?  [["id", 4]]
---
  def destroy
    @report.destroy

SELECT "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_report
      @report = Report.find(params[:id])